---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.Success
enum: Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus
source: html/c87dc425-1e13-40b9-df6d-08fde112210b.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.Success

A valid path of travel between the two points was found. Use [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop]
 to retrieve the calculated points of path of travel.